import { PictureRulesText } from 'shared/ui/pictureRulesText'
import { RulesText } from 'shared/ui/rulesText'

import './gameMechanicsDetails.scss'

export const GameMechanicsDetails = () => {
    return (
        <div className='mechanic-details'>
            <RulesText
                text='Зомби, как и любой
                    ребенок, не может долго стоять на месте и иногда совершает
                    смешную анимацию, часто сбивая крит. удар. Это нормально. По
                    мере того как зомби учится, он будет делать это реже 😊 ❗️Не
                    забудьте нажать на выбитую вами вещь чтобы ее подобрать. На
                    это у вас есть 3 секунды. Да - это не НОТКОИН и не Хомяк.
                    Тут придется думать. ❗️Зомби голодает. Полное восстановление
                    энергии 16 минут. Чтобы покормить зомби, перетащите на него
                    из инвентаря еду (из первых пяти ячеек что дублируются на
                    главном экране). Кормите его выбитым или произведённым мясом
                    и другими вкусняшками. Зомби ест все... Так что внимательно,
                    не скормите ему квестовую вещь. 🏪 Ежедневные задания (сброс
                    в 03:00 по МСК) 🏪 - Призови 🪱 50 раз. Тут все понятно.
                    Кликни на червя 50 раз. - Призови 🐺 4 раза. Подсказка. Респ
                    не прокаченного волка 2 часа. Учтите это, чтобы правильно
                    рассчитать время вызова и уложиться за день. - Пригласи 👫 .
                    Если за день по вашей ссылке присоединиться хотя бы один
                    друг вы получите бонус. ❗️Задания и другие вещи будут
                    зачтены только тогда когда вы ударите по мозгу. Тоесть
                    стоять АФК не получиться. Удар (попадание) по мозгу является
                    подтверждением вашей игры и борьбы с ботами . 🧠 Мирные
                    умения 🧠 Очки мирных умений даются за активность ваших
                    рефералов. Поэтому смысла заводить ботов для этого дела нет.
                    Если только вы за них играть не собираетесь тоже... Эти очки
                    нужны, чтобы заниматься мирными умениями в игре такими как:
                    кулинария, производство, траление, изучать навыки, а также
                    прокачивать персонажу ловкость, выносливость, точность и
                    т.д. лишний опыт мирных умений можно обменять на игровые
                    деньги у призрачного торговца. ❗️ Блокировка и правила ❗️ В
                    отличии от $NOT Coin, Хомяков и других монет, которые ни чем
                    кроме игры (если это можно было назвать игрой) не
                    обусловлены и не имеют ценности, тут вы зарабатываете
                    реальную монету $PJS, которая обусловлена игровым движком
                    PointJS, средой разработки 2D игр PointJS IDE,
                    образовательным проектом Mult-uroki и инфраструктурой,
                    созданной мной за 12 лет. Поэтому давайте не нарушать
                    правила и относиться друг к другу честно. Боты, автокликеры,
                    игра через эмуляторы (браузеры) МЫШКОЙ, взлом исходного кода
                    игры запрещены. Сразу Бан. Первая разблокировка платная.
                    Вторая - пожизненно. Обратите внимание, мы говорим про это
                    заранее и открыто, в отличии от NOT Coin, которые уже по
                    факту прохождения игры списали доход от двойных кликов игре,
                    про которые не было сказано ни слова! В Zombie TAP вы можете
                    жать как угодно. Двойные клики в игре отключены технически!
                    По вопросам разблокировки @multuroki 💲 Реклама: 💲 В нашей
                    игре нет рекламы и тут вы её не увидите. Заказать рекламу
                    также не получится. Но у нас есть интернет-магазин предметов
                    игры. ❗️Если в течении полу года вы не заходите в игру, ваш
                    аккаунт будет удален ❗️ Если игра не запускается, значит
                    время прошлой игровой сессии истекло. Вызовите из меню бота
                    команду старт заново'
            />
            <PictureRulesText text='Котик UPDATE333' />
        </div>
    )
}
